app/views/home/index.html.haml

    #slider
      - Painting.all.each do |painting|
---
SELECT "paintings".* FROM "paintings" ORDER BY created_at