app/controllers/exhibitions_controller.rb

  def create
    ex = Exhibition.create(params[:exhibition])
---
INSERT INTO "exhibitions" ("created_at", "first_column", "kind", "second_column", "third_column", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @exhibition = Exhibition.find(params[:id])
    @exhibition.update_attributes(params[:exhibition])
---
SELECT "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "exhibitions" SET "first_column" = '"Consumed by White1"', "updated_at" = '2013-07-22 04:01:21.700180' WHERE "exhibitions"."id" = 1