app/controllers/home_controller.rb

  def admin
    @user = User.first
    @paintings = Painting.all
    @papers = Paper.all
    @links = Link.all
---
SELECT "paintings".* FROM "paintings"
SELECT "papers".* FROM "papers"
SELECT "links".* FROM "links"