app/controllers/home_controller.rb

SELECT "paintings".* FROM "paintings" ORDER BY created_at
---
  def index
    @paintings = Painting.order(:created_at)

SELECT "users".* FROM "users" LIMIT 1
SELECT "schools".* FROM "schools" ORDER BY created_at DESC
SELECT "teaching_positions".* FROM "teaching_positions" ORDER BY created_at DESC
---
  def about
    @user = User.first
    @solos = Exhibition.solo.order('created_at DESC')
    @groups = Exhibition.group.order('created_at DESC')
    @schools = School.order('created_at DESC')
    @teachings = TeachingPosition.order('created_at DESC')

SELECT "users".* FROM "users" LIMIT 1
---
  def contact
    @user = User.first

SELECT "users".* FROM "users" LIMIT 1
SELECT "paintings".* FROM "paintings" ORDER BY created_at
SELECT "papers".* FROM "papers" ORDER BY created_at
SELECT "links".* FROM "links" ORDER BY created_at
SELECT "schools".* FROM "schools" ORDER BY created_at DESC
SELECT "teaching_positions".* FROM "teaching_positions" ORDER BY created_at DESC
---
  def admin
    @user = User.first
    @paintings = Painting.order(:created_at)
    @papers = Paper.order(:created_at)
    @links = Link.order(:created_at)
    @solos = Exhibition.solo.order('created_at DESC')
    @groups = Exhibition.group.order('created_at DESC')
    @schools = School.order('created_at DESC')
    @positions = TeachingPosition.order('created_at DESC')