app/controllers/links_controller.rb

  def create
    Link.create(params[:link])
---
INSERT INTO "links" ("address", "created_at", "display", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["address", "http://seanmm.com"], ["created_at", Thu, 09 May 2013 19:56:37 UTC +00:00], ["display", "Sean's Portfolio"], ["updated_at", Thu, 09 May 2013 19:56:37 UTC +00:00]]

  def edit
    @link = Link.find(params[:id])
---
SELECT "links".* FROM "links" WHERE "links"."id" = $1 LIMIT 1  [["id", "1"]]

  def destroy
    link = Link.find(params[:id])
    link.delete
---
SELECT "links".* FROM "links" WHERE "links"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "links" WHERE "links"."id" = 1