app/controllers/paintings_controller.rb

SELECT "paintings".* FROM "paintings" ORDER BY created_at
---
  def index
    @paintings = Painting.all

SELECT "paintings".* FROM "paintings" WHERE "paintings"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @painting = Painting.find(params[:id])

SELECT "paintings".* FROM "paintings" WHERE "paintings"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "paintings" SET "name" = '', "description" = '', "image" = 'painting1.jpg', "updated_at" = '2013-06-24 15:27:34.197050' WHERE "paintings"."id" = 25
---
  def update
    painting = Painting.find(params[:id])
    painting.update_attributes(params[:painting])