app/controllers/papers_controller.rb

  def index
    @papers = Paper.all
---
SELECT "papers".* FROM "papers" ORDER BY created_at

  def create
    Paper.create(params[:paper])
---
INSERT INTO "papers" ("created_at", "description", "image", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Mon, 24 Jun 2013 15:30:05 UTC +00:00], ["description", ""], ["image", "parchment.jpg"], ["name", ""], ["updated_at", Mon, 24 Jun 2013 15:30:05 UTC +00:00]]

  def destroy
    paper = Paper.find(params[:id])
    paper.delete
---
SELECT "papers".* FROM "papers" WHERE "papers"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "papers" WHERE "papers"."id" = 1