app/controllers/schools_controller.rb

  def create
    School.create(params[:school])
---
INSERT INTO "schools" ("created_at", "first_column", "second_column", "third_column", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    school = School.find(params[:id])
    school.update_attributes(params[:school])
---
SELECT "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "schools" SET "first_column" = 'Brooklyn College/CUNY1', "updated_at" = '2013-07-22 03:58:43.216861' WHERE "schools"."id" = 1