app/controllers/session_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'david.loncle@gmail.com' LIMIT 1
---
  def create
    user = User.where(:email => params[:email]).first