app/controllers/users_controller.rb

  def edit_bio
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]

  def edit_contact
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]

  def update
    @user = User.find(params[:id])
    @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "users" SET "artist_statement" = 'I believe in aspiring. That endeavor yields being; evinces the assertion of life; circumvents the caprice of society and culture. Art''s triumph is the vessel and fanfare of humanity; it rejects what binds and gesturesus to the soul-sung loving in dream. The valence of experience reveals our starting, and the ever beginning molds our living. Where is where when only we leap.', "bio_image" = 'headshot.jpg', "contact_image" = 'parchment.jpg', "updated_at" = '2013-07-16 01:55:52.034985' WHERE "users"."id" = 3